STMicroelectronics/STM32DDRFW-UTIL/DDR_Tool/STM32MP157C-EV1/Src/ddr_tool.c
  /* Identify command and parameters */
  for (i = 0; i < (int)size; i++)
  {
    if (entry[i] == '\0')
    {
      break;
    }
    if (entry[i] == ' ')
    {
      continue;
    }

    if (n == 0)
    {
      cmd.off = i;
    }
    else
    {
      arg.off = i;
    }

    while ((entry[i] != ' ') && (entry[i] != '\0'))
    {
      i++;
    }

    if (n == 0)
    {
      cmd.len = i - cmd.off;
    }
    else
    {
      arg.len = i - arg.off;
      argv[n - 1] = (char *)malloc(arg.len + 1);
      strncpy(argv[n - 1], &entry[arg.off], arg.len);
      strncpy(argv[n - 1] + arg.len, "\0", 1);
    }

    n++;

    if (n > CMD_MAX_ARG + 1)
    {
      printf("Too many arguments (max=%d)\n\r", CMD_MAX_ARG);
      return -1;
    }

    i--;
  }

  /* Case of empty string, simple ignore, no error */
  if ((n == 0) && (cmd.len == 0))
  {
    return 0;
  }

  /* Get command */
  for (i = 0; i < DDR_CMD_UNKNOWN; i++)
  {
    if (   !strncmp(&entry[cmd.off], ddr_cmd[i].str, cmd.len)
        && (cmd.len == strlen(ddr_cmd[i].str)))
    {
      *command = i;
      break;
    }
  }

  /* Case of unknown command */
  if (i == DDR_CMD_UNKNOWN)
  {
    printf("Unknown command\n\r");
    return -2;
  }

  /* Check number of parameters */
  if ((n - 1) < ddr_cmd[*command].param_min)
  {
    printf("%s: argument missing (min=%d)\n\r", ddr_cmd[*command].str,
                                                ddr_cmd[*command].param_min);
    return -3;
  } else if ((n - 1) > ddr_cmd[*command].param_max)
  {
    printf("%s: too many arguments (max=%d)\n\r", ddr_cmd[*command].str,
                                                  ddr_cmd[*command].param_max);
    return -4;
  }

  /* Case of commands with "help" first parameter, ignore other ones */
  if ((n >= 2) && (argv[0] != NULL))
  {
    if (!strcmp(argv[0], "help"))
    {
      switch (*command)
      {
      case DDR_CMD_TEST:
            *command = DDR_CMD_TEST_HELP;
            break;
      }
      return 1;
    }
  }

  /* return number of arguments, including command and parameters */
  return n;
}

static int64_t string_to_num(char *string)
{
  char *end_ptr;
  uint64_t val = strtoul(string, &end_ptr, 0);

  if (end_ptr == string)
  {
    return -1;
  }

  return val;
}

static void print_usage(void)
{
  const char *usage = {
    "commands:\n\r\n\r"
    "help                       displays help\n\r"
    "info                       displays DDR information\n\r"
    "info  <param> <val>        changes DDR information\n\r"
    "      with <param> = step, name, size or speed\n\r"
    "freq                       displays the DDR PHY frequency in kHz\n\r"
    "freq  <freq>               changes the DDR PHY frequency\n\r"
    "param [type|reg]           prints input parameters\n\r"
    "param <reg> <val>          edits parameters in step 0\n\r"
    "print [type|reg]           dumps registers\n\r"
    "edit <reg> <val>           modifies one register\n\r"
    "save                       output formated DDR regs to be saved\n\r"
    "step                       lists the available step\n\r"
    "step <n>                   go to the step <n>\n\r"
    "next                       goes to the next step\n\r"
    "go                         continues the DDR TOOL execution\n\r"
    "reset                      reboots machine\n\r"
    "test [help] | <n> [...]    lists (with help) or executes test <n>\n\r"
    "\n\rwith for [type|reg]:\n\r"
    "  all registers if absent\n\r"
    "  <type> = ctl, phy\n\r"
    "           or one category (static, timing, map, perf, dyn)\n\r"
    "  <reg> = name of the register\n\r"
  };

  printf(usage);
}

static void print_single_subcmd_usage(const subcmd_desc *array, int i)
{

      printf("  %2d: %s %s\n\r", i, array[i].name, array[i].usage);
      printf("          %s\n\r", array[i].help);
}

static void print_subcmd_usage(const subcmd_desc *array, const int size)
{
  int i;

  printf("commands:\n\r\n\r");

  for (i = 0; i < size; i++)
  {
      print_single_subcmd_usage(array, i);
  }
}

static bool check_step(HAL_DDR_InteractStepTypeDef step,
                       HAL_DDR_InteractStepTypeDef expected)
{
  if (step != expected)
  {
    printf("invalid step %d:%s expecting %d:%s\n\r",
           step, step_str[step], expected, step_str[expected]);
    return false;
  }

  return true;
}

static void free_args(int argc, char *argv[])
{
  int i;

  for (i = 1; i < argc; i++)
  {
    free(argv[i - 1]);
  }
}

static bool pll2_set_rate(uint64_t pll2_clk_rate)
{
  RCC_PLLInitTypeDef PLL2;
  uint64_t value;
  uint64_t fck_ref;
  lldiv_t div_res;
  uint32_t tickstart;

  PLL2.PLLM = ((READ_REG(RCC->PLL2CFGR1) & RCC_PLL2CFGR1_DIVM2) >>
               RCC_PLL2CFGR1_DIVM2_Pos) + 1U;
  PLL2.PLLN = ((READ_REG(RCC->PLL2CFGR1) & RCC_PLL2CFGR1_DIVN) >>
               RCC_PLL2CFGR1_DIVN_Pos) + 1U;
  PLL2.PLLP = ((READ_REG(RCC->PLL2CFGR2) & RCC_PLL2CFGR2_DIVP) >>
               RCC_PLL2CFGR2_DIVP_Pos) + 1U;
  PLL2.PLLQ = ((READ_REG(RCC->PLL2CFGR2) & RCC_PLL2CFGR2_DIVQ) >>
               RCC_PLL2CFGR2_DIVQ_Pos) + 1U;
  PLL2.PLLR = ((READ_REG(RCC->PLL2CFGR2) & RCC_PLL2CFGR2_DIVR) >>
               RCC_PLL2CFGR2_DIVR_Pos) + 1U;
  PLL2.PLLFRACV = (READ_REG(RCC->PLL2FRACR) & RCC_PLL2FRACR_FRACV) >>
                  RCC_PLL2FRACR_FRACV_Pos;

  switch (__HAL_RCC_GET_PLL12_SOURCE())
  {
    case RCC_PLL12SOURCE_HSI:
      fck_ref = HSI_VALUE;
      break;
    case RCC_PLL12SOURCE_HSE:
      fck_ref = HSE_VALUE;
      break;
    default:
      printf("PLL2 OSC clock source is not set properly\n\r");
      return false;
  }

  /* Calculate new settings */
  value = (pll2_clk_rate * PLL2.PLLR * PLL2.PLLM) << 13;
  div_res = lldiv(value, fck_ref);
  value = div_res.quot;

  PLL2.PLLN = value >> 13;

  if ((PLL2.PLLN < UTIL_PLL2_DIVN_MIN) || (PLL2.PLLN > UTIL_PLL2_DIVN_MAX))
  {
    printf("PLL2.PLLN invalid = %d\n\r", (int)PLL2.PLLN);
    return false;
  }

  PLL2.PLLFRACV = value - (PLL2.PLLN << 13);

  /*******************/
  /* Reconfigure PLL */
  /*******************/
  /* Disable the post-dividers */
  __HAL_RCC_PLL2CLKOUT_DISABLE(RCC_PLL2_DIVP | RCC_PLL2_DIVQ | RCC_PLL2_DIVR);

  /* Disable the main PLL */
  __HAL_RCC_PLL2_DISABLE();

