STMicroelectronics/STM32DDRFW-UTIL/DDR_Tool/STM32MP157C-EV1/Src/ddr_tool.c
  /* Get Start Tick */
  tickstart = HAL_GetTick();

  /* Wait till PLL is ready */
  while (__HAL_RCC_GET_FLAG(RCC_FLAG_PLL2RDY) != RESET)
  {
    if ((HAL_GetTick() - tickstart) > PLL_TIMEOUT_VALUE)
    {
      printf("PLL2 stop timeout\n\r");
      return false;
    }
  }

  /* Configure the PLL2 multiplication and division factors */
  __HAL_RCC_PLL2_CONFIG(
    PLL2.PLLM,
    PLL2.PLLN,
    PLL2.PLLP,
    PLL2.PLLQ,
    PLL2.PLLR);

  /* Configure the Fractional Divider */
  __HAL_RCC_PLL2FRACV_DISABLE();

  /* Configure PLL  PLL2FRACV  in fractional mode */
  __HAL_RCC_PLL2FRACV_CONFIG(PLL2.PLLFRACV);

  __HAL_RCC_PLL2FRACV_ENABLE();

  /* Do not use the Spread Control */
  __HAL_RCC_PLL2_SSMODE_DISABLE();

  /* Enable the PLL2 */
  __HAL_RCC_PLL2_ENABLE();

  /* Get Start Tick */
  tickstart = HAL_GetTick();

  /* Wait till PLL is ready */
  while (__HAL_RCC_GET_FLAG(RCC_FLAG_PLL2RDY) == RESET)
  {
    if ((HAL_GetTick() - tickstart) > PLL_TIMEOUT_VALUE)
    {
      printf("PLL2 start timeout\n\r");
      return false;
    }
  }

  /* Enable the post-dividers */
  __HAL_RCC_PLL2CLKOUT_ENABLE(RCC_PLL2_DIVP | RCC_PLL2_DIVQ | RCC_PLL2_DIVR);

  return true;
}

static void do_info(HAL_DDR_InteractStepTypeDef step, int argc, char *argv[])
{
  unsigned long value;
  static char *ddr_name;
  char *end_ptr;

  if (argc == 1)
  {
    printf("step = %d : %s\n\r", step, step_str[step]);
    printf("name = %s\n\r", static_ddr_config.info.name);
    printf("size = 0x%lx\n\r", static_ddr_config.info.size);
    printf("speed = %ld kHz\n\r", static_ddr_config.info.speed);
    return;
  }

  if (argc < 3)
  {
    printf("not enough parameters\n\r");
    return;
  }

  if (!strcmp(argv[0], "name"))
  {
    uint32_t i;
    uint32_t name_len = argc;

    for (i = 1; i < (argc - 1); i++)
    {
      name_len += strlen(argv[i]) + 1;
    }

    if (ddr_name)
    {
      free(ddr_name);
    }

    ddr_name = malloc(name_len);
    static_ddr_config.info.name = ddr_name;
    if (!ddr_name)
    {
      printf("alloc error, length %ld\n\r", name_len);
      return;
    }

    strcpy(ddr_name, argv[1]);
    for (i = 2; i < (argc - 1); i++)
    {
      strcat(ddr_name, " ");
      strcat(ddr_name, argv[i]);
    }
    printf("name = %s\n\r", ddr_name);
    return;
  }

  if (!strcmp(argv[0], "size"))
  {
    value = strtoll(argv[1], &end_ptr, 16);
    if (end_ptr == argv[1])
    {
      printf("invalid value %s\n\r", argv[1]);
    }
    else
    {
      static_ddr_config.info.size = value;
      printf("size = 0x%lx\n\r", static_ddr_config.info.size);
    }
    return;
  }

  if (!strcmp(argv[0], "speed"))
  {
    PLL2_ClocksTypeDef PLL2;

    value = strtoll(argv[1], &end_ptr, 10);
    if (end_ptr == argv[1])
    {
      printf("invalid value %s\n\r", argv[1]);
    }
    else
    {
      static_ddr_config.info.speed = value;
      printf("speed = %ld kHz\n\r", static_ddr_config.info.speed);
      HAL_RCC_GetPLL2ClockFreq(&PLL2);
      value = PLL2.PLL2_R_Frequency;
      printf("DDRPHY = %ld kHz\n\r", value / 1000);
    }
    return;
  }

  printf("argument %s invalid\n\r", argv[0]);
}

static bool do_freq(int argc, char *argv[])
{
  PLL2_ClocksTypeDef PLL2;
  unsigned long value;
  char *end_ptr;
  bool ret_code = true;

  if (argc == 2)
  {
    value = strtoll(argv[0], &end_ptr, 0) * 1000;
    if (end_ptr == argv[0])
    {
      printf("invalid argument %s\n\r", argv[0]);
      return false;
    }

    HAL_RCC_GetPLL2ClockFreq(&PLL2);
    if (value == PLL2.PLL2_R_Frequency)
    {
      printf("Same frequency, no change.\n\r");
      return true;
    }
    else
    {
      HAL_DDR_ASS_Set_Clksrc(HAL_DDR_CLK_AXI_HSI);

      ret_code = pll2_set_rate(value);

      HAL_DDR_ASS_Set_Clksrc(HAL_DDR_CLK_AXI_PLL2);
    }
  }

  HAL_RCC_GetPLL2ClockFreq(&PLL2);
  printf("DDRPHY = %ld kHz\n\r", PLL2.PLL2_R_Frequency / 1000);

  return ret_code;
}

static void do_param(HAL_DDR_InteractStepTypeDef step, int argc, char *argv[])
{
  char reg_name[(argc == 1)? 0 : strlen(argv[0])];

  switch (argc)
  {
  case 1:
    HAL_DDR_Dump_Param(&static_ddr_config, NULL);
    break;
  case 2:
    HAL_DDR_Convert_Case(argv[0], reg_name, 1); /* convert to upper case */

    if (HAL_DDR_Dump_Param(&static_ddr_config, reg_name) != HAL_OK)
    {
      printf("invalid argument %s\n\r", argv[0]);
    }
    break;
  case 3:
    if (!check_step(step, STEP_DDR_RESET))
    {
      return;
    }
    HAL_DDR_Convert_Case(argv[0], reg_name, 1); /* convert to upper case */
    HAL_DDR_Edit_Param(&static_ddr_config, reg_name, argv[1]);
    break;
  }
}

static void do_print(int argc, char * const argv[])
{
  char reg_name[(argc == 1)? 0 : strlen(argv[0])];

  switch (argc)
  {
    case 1:
      HAL_DDR_Dump_Reg(NULL, false);
      break;
    case 2:
      HAL_DDR_Convert_Case(argv[0], reg_name, 1); /* convert to upper case */

      if (HAL_DDR_Dump_Reg(reg_name, false) != HAL_OK)
      {
        printf("invalid argument %s\n\r", reg_name);
      }
      break;
  }
}

static HAL_DDR_InteractStepTypeDef do_step(HAL_DDR_InteractStepTypeDef step,
                                           int argc, char *argv[])
{
  int i;
  unsigned long value;
  char *end_ptr;

  switch (argc)
  {
    case 1:
      for (i = 0; i <= STEP_RUN; i++)
      {
        printf("%d:%s\n\r", i, step_str[i]);
      }
      break;

    case 2:
      value = strtoll(argv[0], &end_ptr, 0);
      if ((end_ptr == argv[0]) || (value > STEP_RUN))
      {
        printf("invalid argument %s\n\r", argv[1]);
        goto end;
      }

      if ((value != STEP_DDR_RESET) && (value <= step))
      {
        printf("invalid target %d:%s, current step is %d:%s\n\r",
               (int)value, step_str[value], step, step_str[step]);
        goto end;
      }
      printf("step to %d:%s\n\r", (int)value, step_str[value]);
      return (HAL_DDR_InteractStepTypeDef)value;
  };

end:
  return step;
}

static void do_subcmd(int argc, char *argv[], const subcmd_desc *array,
                      const int size)
{
  int i;
  int64_t value;
  int local_argc = argc;
  uint32_t retcode;
  char arg_zero[2] = "0\0";

