STMicroelectronics/STM32DDRFW-UTIL/DDR_Tool/STM32MP157C-EV1/Src/ddr_tool.c
  if (local_argc == 1)
  {
    printf("Please enter a sub command number\n\r\n\r");
    print_subcmd_usage(array, size);
    return;
  }

  /* Check sub command ID */
  value = string_to_num(argv[0]);
  if ((value < 0) || (value >= size))
  {
    printf("Unknown sub command [%s]\n\r\n\r", argv[0]);
    print_subcmd_usage(array, size);
    return;
  }

  /*
   * Test All command is also differently treated, regrding number of
   * arguments (0, 1, 2). So complete arguments to have a generic API including
   * number of valid arguments in third position.
   */
  if ((array == test) && (array[value].fct == DDR_Test_All))
  {
    switch (local_argc - 2)
    {
    case 0:
      argv[1] = arg_zero;
    case 1:
      argv[2] = arg_zero;
    case 2:
      argv[3] = arg_zero;
    case 3:
      local_argc = array[value].max_args + 2;
      break;
    default:
      local_argc = -1;
      break;
    }
  }

  /* Check number of sub command arguments */
  if ((uint8_t)(local_argc - 2) != array[value].max_args)
  {
    /* any other cases */
    printf("Incorrect number of arguments\n\r\n\r");
    print_single_subcmd_usage(array, value);
    return;
  }

  /* Check argument validity */
  for (i = 1; i <= (local_argc - 2); i++)
  {
    if (string_to_num(argv[i]) < 0)
    {
      printf("Invalid argument #%d %s\n\r\n\r", i, argv[i]);
      print_single_subcmd_usage(array, value);
      return;
    }
  }

  switch (array[value].max_args)
  {
    case 0:
      retcode = array[value].fct();
      break;
    case 1:
      retcode = array[value].fct((uint32_t)string_to_num(argv[1]));
      break;
    case 2:
      retcode = array[value].fct((uint32_t)string_to_num(argv[1]),
                                (uint32_t)string_to_num(argv[2]));
      break;
    case 3:
      retcode = array[value].fct((uint32_t)string_to_num(argv[1]),
                                (uint32_t)string_to_num(argv[2]),
                                (uint32_t)string_to_num(argv[3]));
      break;
    default:
      printf("Number of arguments not supported\n\r");
      retcode = 0XFFFFFFFF;
      break;
  }

  if (retcode != 0)
  {
    printf("%s failed [%ld]\n\r", array[value].name, retcode);
    return;
  }

    printf("Result: Pass [%s]\n\r", array[value].name);
}

bool HAL_DDR_Interactive(HAL_DDR_InteractStepTypeDef step)
{
  char buffer[CMD_MAX_LEN];
  char *argv[CMD_MAX_ARG + 1]; /* NULL terminated */
  int argc;
  int cmd;
  static int next_step = -1;

  if ((next_step < 0) && (step == STEP_DDR_RESET))
  {
    next_step = STEP_DDR_RESET;
  }

//  printf("** step %d ** %s / %d\n\r", step, step_str[step], next_step);

  if (next_step < 0)
  {
    return false;
  }

  if (step < 0 || step > STEP_RUN)
  {
    printf("** step %d ** INVALID\n\r", step);
    return false;
  }

  printf("%d:%s\n\r", step, step_str[step]);

  if (next_step > step)
  {
    return false;
  }

  while (next_step == step)
  {
    get_entry_string(buffer);

    argc = parse_entry_string(buffer, strlen(buffer), &cmd, argv);
    if (argc < 0)
    {
      printf("Error [%d]\n\r", argc);
      continue;
    }
    else if (argc == 0)
    {
      continue;
    }

    switch (cmd)
    {
    case DDR_CMD_HELP:
      print_usage();
      break;

    case DDR_CMD_TEST_HELP:
      print_subcmd_usage(test, test_nb);
      break;

    case DDR_CMD_INFO:
      do_info(step, argc, argv);
      break;

    case DDR_CMD_FREQ:
      if (do_freq(argc, argv))
      {
        next_step = STEP_DDR_RESET;
      }
      break;

    case DDR_CMD_RESET:
      __HAL_RCC_SYS_RESET();
      break;

    case DDR_CMD_PARAM:
      do_param(step, argc, argv);
      break;

    case DDR_CMD_PRINT:
      do_print(argc, argv);
      break;

    case DDR_CMD_EDIT:
      HAL_DDR_Edit_Reg(argv[0], argv[1]);
      break;

    case DDR_CMD_SAVE:
      HAL_DDR_Dump_Reg(NULL, true);
      break;

    case DDR_CMD_GO:
      next_step = STEP_RUN;
      printf("### Exit DDR INTERACTIVE mode. Please RESET the BOARD ###\n\r");
      break;

    case DDR_CMD_NEXT:
      next_step = step + 1;
      break;

    case DDR_CMD_STEP:
      next_step = do_step(step, argc, argv);
      break;

    case DDR_CMD_TEST:
      if (!check_step(step, STEP_DDR_READY))
      {
        free_args(argc, argv);
        continue;
      }
      do_subcmd(argc, argv, test, test_nb);
      break;

    default:
      break;
    }

    free_args(argc, argv);
  }

  return next_step == STEP_DDR_RESET;
}
